
&НаСервере
Процедура СформироватьОтчетНаСервере(КлючУникальности)
	
	
	Результат.Очистить();	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если РассрочкаОднойСтрокой тогда
    Схема = ОтчетОбъект.ПолучитьМакет("РасшифровкаОтчетаРассрочкаОднойСтрокой");
	иначе
    Схема = ОтчетОбъект.ПолучитьМакет("РасшифровкаОтчета");
	КонецЕсли; 
	
    Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
    Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	//Компоновщик.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.настройки);
	//Компоновщик.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	Компоновщик.ЗагрузитьПользовательскиеНастройки(Компоновщик.ПользовательскиеНастройки);
    
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=НачалоДня(Период.ДатаНачала);
	
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=КонецДня(Период.ДатаОкончания);
	
	ПараметрДопСогл = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Партнер"));
	ПараметрДопСогл.Использование=Истина;
	ПараметрДопСогл.Значение=Отчет.партнер;
	
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(Схема, Компоновщик.Настройки,ДанныеРасшифровкиКомпоновки);
	
//СкомпоноватьРезультат(Результат, ДанныеРасшифровки); 
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет,,ДанныеРасшифровкиКомпоновки);
		
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ДанныеРасшифровки=ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки,КлючУникальности);
	
	
	
КонецПроцедуры

Процедура 	ВывестиОстаткиОбороты(передДата,Режим,запрос,ДокументРезультат,макет);

	Если Режим="Остатки" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ХозрасчетныйОстатки6202.Субконто1, ХозрасчетныйОстатки.Субконто1) КАК Контрагент,
		|	ЕСТЬNULL(ХозрасчетныйОстатки6202.Субконто3, ХозрасчетныйОстатки.Субконто2) КАК Документ,
		|	ХозрасчетныйОстатки6202.СуммаОстатокКт КАК СуммаСч6202,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки6202.СуммаОстатокКт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2)) КАК РасчетныйНДС,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0) КАК СуммаСч76АВ,
		|	(ВЫРАЗИТЬ(ХозрасчетныйОстатки6202.СуммаОстатокКт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2))) - ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0) КАК Разность
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &Счет62, , Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки6202
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, счет = &Счет76АВ, , Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки
		|		ПО ХозрасчетныйОстатки6202.Субконто1 = ХозрасчетныйОстатки.Субконто1
		|			И ХозрасчетныйОстатки6202.Субконто3 = ХозрасчетныйОстатки.Субконто2
		|ИТОГИ
		|	СУММА(СуммаСч6202),
		|	СУММА(РасчетныйНДС),
		|	СУММА(СуммаСч76АВ),
		|	СУММА(Разность)
		|ПО
		|	Контрагент";
	

	ИначеЕсли Режим="ОборотыДт" Тогда
				Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.Субконто1, ХозрасчетныйОбороты.Субконто1) КАК Контрагент,
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.Субконто3, ХозрасчетныйОбороты.Субконто2) КАК Документ,
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.СуммаОборотДт, 0) КАК СуммаСч6202,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты62.СуммаОборотДт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2)) КАК РасчетныйНДС,
		|	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК СуммаСч76АВ,
		|	(ВЫРАЗИТЬ(ХозрасчетныйОбороты62.СуммаОборотДт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2))) - ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК Разность
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, , Счет = &Счет62, , Субконто1 = &Контрагент, , ) КАК ХозрасчетныйОбороты62
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, , счет = &Счет76АВ, , Субконто1 = &Контрагент, , ) КАК ХозрасчетныйОбороты
		|		ПО ХозрасчетныйОбороты62.Субконто1 = ХозрасчетныйОбороты.Субконто1
		|			И ХозрасчетныйОбороты62.Субконто3 = ХозрасчетныйОбороты.Субконто2
		|ИТОГИ
		|	СУММА(СуммаСч6202),
		|	СУММА(РасчетныйНДС),
		|	СУММА(СуммаСч76АВ),
		|	СУММА(Разность)
		|ПО
		|	Контрагент";
ИначеЕсли Режим="ОборотыКт" Тогда
				Запрос.Текст= 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.Субконто1, ХозрасчетныйОбороты.Субконто1) КАК Контрагент,
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.Субконто3, ХозрасчетныйОбороты.Субконто2) КАК Документ,
		|	ЕСТЬNULL(ХозрасчетныйОбороты62.СуммаОборотКт, 0) КАК СуммаСч6202,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты62.СуммаОборотКт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2)) КАК РасчетныйНДС,
		|	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаСч76АВ,
		|	(ВЫРАЗИТЬ(ХозрасчетныйОбороты62.СуммаОборотКт * &РасчетнаяСтавкаНДС / (100+&РасчетнаяСтавкаНДС) КАК ЧИСЛО(10, 2))) - ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК Разность
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, , Счет = &Счет62, , Субконто1 = &Контрагент, , ) КАК ХозрасчетныйОбороты62
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, , счет = &Счет76АВ, , Субконто1 = &Контрагент, , ) КАК ХозрасчетныйОбороты
		|		ПО ХозрасчетныйОбороты62.Субконто1 = ХозрасчетныйОбороты.Субконто1
		|			И ХозрасчетныйОбороты62.Субконто3 = ХозрасчетныйОбороты.Субконто2
		|ИТОГИ
		|	СУММА(СуммаСч6202),
		|	СУММА(РасчетныйНДС),
		|	СУММА(СуммаСч76АВ),
		|	СУММА(Разность)
		|ПО
		|	Контрагент";
	
	КонецЕсли; //Если Режим="Остатки" Тогда
	
	Запрос.УстановитьПараметр("Дата",передДата );
	Запрос.УстановитьПараметр("Счет76АВ", ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));	
	
    облконтрагентОстатков=Макет.получитьОбласть("ОблКонтрагентНО");
 
    облДЗОстатков=Макет.получитьОбласть("ОблДокумент");
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтаргент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтаргент.Следующий() Цикл
   облконтрагентОстатков.параметры.заполнить(ВыборкаКонтаргент); 
    ДокументРезультат.вывести(облконтрагентОстатков);
	
		ВыборкаДетальныеЗаписи = ВыборкаКонтаргент.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
          облДЗОстатков.параметры.заполнить(ВыборкаДетальныеЗаписи);	     
	     ДокументРезультат.вывести(облДЗОстатков);
	КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура СформироватьОтчет(Команда)
	КлючУникальности = Новый УникальныйИдентификатор; 
	СформироватьОтчетНаСервере(КлючУникальности);
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	если не параметры.Партнер=справочники.Партнеры.пустаяССылка() Тогда 
		Отчет.партнер=Параметры.партнер;
	КонецЕсли;	
	Если параметры.РассрочкаОднойСтрокой тогда
		РассрочкаОднойСтрокой=истина;
	иначе
		РассрочкаОднойСтрокой=Ложь;
	КонецЕсли;
		период.ДатаНачала=параметры.ДатаНачала;
		период.ДатаОкончания=параметры.ДатаОкончания;

 КонецПроцедуры


&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Расшифровка)

	  Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	  Поля = Данные.Элементы[Расшифровка].ПолучитьПоля();
	  Документ=Поля[0].Значение;
		  
КонецПроцедуры



&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = истина;   
	
	СтандартнаяОбработка=ложь;
    РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	ПоказатьЗначение(,Документ);
	
	  //ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет);     
	  ////ОбработкаРасшифровкиКД = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);           
	  //
	  //ИмяПоля="";  ИмяЗначения=""; 
	  //ПолучитьРасшифровкуНаСервере(Расшифровка,ИмяПоля,ИмяЗначения);
	  //
	  //Сообщить(" "+ИмяПоля+" "+ИмяЗначения);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлючУникальности = Новый УникальныйИдентификатор; 
	СформироватьОтчетНаСервере(КлючУникальности);
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьЭлементОтбораКомпоновкиДанных(ОтборНастройкиКомпоновкиДанных,Использование,ВидСрав,ИмяПоля,ЗначениеОтбора)
    
    НовыйЭлемент = ОтборНастройкиКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    
    НовыйЭлемент.Использование  = Использование;
    НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);
    НовыйЭлемент.ВидСравнения   = ВидСрав;
    НовыйЭлемент.ПравоеЗначение = ЗначениеОтбора;
    
КонецПроцедуры


&НаКлиенте
Процедура Оборотка(Команда)
//	ОбороткаНаСервере();
//https://infostart.ru/public/345249/
//Имя вызываемого отчета карточка,анализ, ОСВ по счету . Я делал только для этих трех.
   // ИмяОтчета = "КарточкаСчета";
    ИмяОтчета="ОборотноСальдоваяВедомостьПоСчету";
    //Заполняем реквизиты отчета и обязательные поля (могут отличаться в зависимости от отчета) 
    ПользовательскиеНастройкиКомпоновкиДанных = Новый ПользовательскиеНастройкиКомпоновкиДанных;
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("Счет", Счет);
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("ПоСубсчетам", Истина);
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("НачалоПериода" , Период.ДатаНачала);
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("КонецПериода"  , Период.ДатаОкончания);
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("Организация"   , Отчет.Организация);
	
	
	НоваяГруппировкаСубконто = Новый Массив;
    
    ОписаниеГруппировки = Новый Структура("Использование,Поле", Истина, "Субконто1");
    НоваяГруппировкаСубконто.Добавить(ОписаниеГруппировки);
    ОписаниеГруппировки = Новый Структура("Использование,Поле", Истина, "Субконто2");
    НоваяГруппировкаСубконто.Добавить(ОписаниеГруппировки);
    ОписаниеГруппировки = Новый Структура("Использование,Поле", Истина, "Субконто3");
    НоваяГруппировкаСубконто.Добавить(ОписаниеГруппировки);
	
    ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("Группировка", НоваяГруппировкаСубконто);	
	
    //Заполняем дополнительные отборы (в примере только для субконто1 и субконто2)
    НовыйОтбор                                        = ПользовательскиеНастройкиКомпоновкиДанных.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
    НовыйОтбор.ИдентификаторПользовательскойНастройки = "Отбор";    
    ЗаполнитьЭлементОтбораКомпоновкиДанных(НовыйОтбор,Истина,ВидСравненияКомпоновкиДанных.Равно,"Субконто1", Отчет.Контрагент);
	//ЗаполнитьЭлементОтбораКомпоновкиДанных(НовыйОтбор,Истина,ВидСравненияКомпоновкиДанных.Равно,"Субконто2", Договор);

	//НоваяГруппировка = ПользовательскиеНастройкиКомпоновкиДанных.Элементы.Добавить("ГруппировкаКомпоновкиДанных");
	//НоваяГруппировка.
	
	
    //Обязателньо указываем ключ (Равным параметру "ИДРасшифровки",я указывал Имя отчета ) НастройкиРасшифровки
    НастройкиРасшифровки = Новый Структура;
    НастройкиРасшифровки.Вставить(ИмяОтчета, ПользовательскиеНастройкиКомпоновкиДанных);
    
    УсловияОтбора = Новый Структура();
    УсловияОтбора.Вставить("НастройкиРасшифровки", НастройкиРасшифровки);
    
    //Дублируем настройки (у меня в файловой без этого не открывалось)
    ОбщиеНастройки = Новый Структура();
    ОбщиеНастройки.Вставить("Объект"              , УсловияОтбора);
    ОбщиеНастройки.Вставить("НастройкиРасшифровки", НастройкиРасшифровки);
    
    //Помещаем во временное хранилище (Уид можно случайный)
    АлресХранилища = ПоместитьВоВременноеХранилище(ОбщиеНастройки, Новый УникальныйИдентификатор);
    
    //Обращаем внимания на заполнемые настройки, если вы укажете отбор = истина то затрется все выше указанные отборы 
    //( поскольку показатели и группировки я не менял, то оставил их типоыми) 
    ЗаполнятьТиповыеНастройки = Новый Структура;
    ЗаполнятьТиповыеНастройки.Вставить("Отбор"          , Ложь);
    ЗаполнятьТиповыеНастройки.Вставить("Группирова"     , Истина);
    ЗаполнятьТиповыеНастройки.Вставить("ВыводимыеДанные", Истина);
    ЗаполнятьТиповыеНастройки.Вставить("Показатели"     , Истина);
    
    //Сами параметры для предачи на форму ("ИДРасшифровки" - в данном случаи ключ от структуры НастройкиРасшифровки , если "СформироватьПриОткрытии" будет равно Ложь
    //то отчет откроется с ранее сохраненными настройками)     
    ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ВидРасшифровки"         , 1);
    ПараметрыОтчета.Вставить("АдресНастроек"          , АлресХранилища);
    ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
    ПараметрыОтчета.Вставить("ИДРасшифровки"          , ИмяОтчета);
    ПараметрыОтчета.Вставить("РежимРасшифровки"       , Истина);
    ПараметрыОтчета.Вставить("ЗаполняемыеНастройки"   , ЗаполнятьТиповыеНастройки);
    
    //Ну и открываем саму форму
    ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма.ФормаОтчета", ПараметрыОтчета,ЭтаФорма);

	
	
КонецПроцедуры

