
&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Расшифровка)

	  Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	  Поля = Данные.Элементы[Расшифровка].ПолучитьПоля();
	  перЗнч=Поля[0].Значение;
		  если ТипЗнч(перЗнч)=тип("СправочникСсылка.Партнеры") Тогда 
			  Отчет.Партнер=перЗнч;
		  иначе
			  
		  КонецЕсли;
		  
	//Схема = ОтчетОбъект.ПолучитьМакет("РасшифровкаОтчета");
	//
	//Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	//Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
		  
		  
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка=ложь;
    РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	  ПараметрыФормы=новый Структура;
	  ПараметрыФормы.Вставить("Партнер",Отчет.Партнер);
	  ПараметрыФормы.Вставить("ДатаНачала",Период.ДатаНачала);
	  ПараметрыФормы.Вставить("ДатаОкончания",Период.ДатаОкончания);
	  ПараметрыФормы.Вставить("РассрочкаОднойСтрокой",РассрочкаОднойСтрокой);
	  //ОткрытьФорму("ВнешнийОтчет.РасчетыСФизЛицами.Форма.ДопФормаСКД",ПараметрыФормы,ЭтаФорма); 
	  ОткрытьФорму("Отчет.РасчетыСФизЛицами.Форма.ДопФормаСКД",ПараметрыФормы,ЭтаФорма); 
	  
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(КлючУникальности)
	
	Результат.Очистить();	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Если ПустаяСтрока(Муниципальные) или Муниципальные="Все" тогда
         Схема = ОтчетОбъект.ПолучитьМакет("Макет");
    Конецесли;

	Если Муниципальные="Исключая" или Муниципальные="Включая" тогда
         Схема = ОтчетОбъект.ПолучитьМакет("МакетМун");
    Конецесли;
	
	
    Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
    Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	//Компоновщик.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.настройки);
	Компоновщик.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	//Компоновщик.ЗагрузитьПользовательскиеНастройки(Компоновщик.ПользовательскиеНастройки);
    
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=НачалоДня(Период.ДатаНачала);
	
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=КонецДня(Период.ДатаОкончания);
	
	
	Если НЕ Отчет.партнер=Справочники.Партнеры.ПустаяСсылка() Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Партнер");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = отчет.Партнер; 	
	КонецЕсли;
	
	Если Муниципальные="Включая" Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("муниципальные");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = истина; 	
	КонецЕсли;
	
	Если Муниципальные="Исключая" Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("муниципальные");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ложь; 	
	КонецЕсли;
	
	Если Отчет.Партнер.Пустая() и Отчет.ЛицевыеСчета.Количество()>0 Тогда  
		            
		СписокЛицевых = новый СписокЗначений;
		
		Для Каждого стр из отчет.ЛицевыеСчета цикл
			СписокЛицевых.Добавить(стр.ЛицевойСчет);
		КонецЦикла;
		
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("ЛицевойСчет");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;   
		Если Исключить = истина тогда
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		иначе	
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;	
		НовыйЭлементОтбора.ПравоеЗначение = СписокЛицевых; 	
	КонецЕсли;
	
	
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(Схема, Компоновщик.Настройки,ДанныеРасшифровкиКомпоновки);
	
//СкомпоноватьРезультат(Результат, ДанныеРасшифровки); 
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет,,ДанныеРасшифровкиКомпоновки);
		
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ДанныеРасшифровки=ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки,КлючУникальности);
КонецПроцедуры


&НаКлиенте
Процедура СформироватьОтчет()
	КлючУникальности = Новый УникальныйИдентификатор; 
	СформироватьОтчетНаСервере(КлючУникальности);
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчет();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала=НачалоГода(ТекущаяДата());
	Период.ДатаОкончания=конецдня(ТекущаяДата());
	РассрочкаОднойСтрокой=Истина;
	
	Если параметры.Свойство("ИзНачисленияПроцентов") тогда
		 отчет.Партнер=параметры.партнер;
		 отчет.ИзНачисленияПроцентов=параметры.ИзНачисленияПроцентов;
		 КонтрагентПриИзмененииНаСервере();
		 РассрочкаОднойСтрокой=Ложь;
		 Период.ДатаНачала=НачалоМесяца(параметры.ДатаДокумента);
		 Период.ДатаОкончания=КонецМесяца(Параметры.ДатаДокумента);
	КонецЕсли;
	
	Муниципальные="Все";
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	отчет.ЛицевыеСчета.Очистить();
	отчет.ЛицевойСчет=Справочники.ВДГБ_ЛицевыеСчета.ПустаяСсылка();
	
	Если Отчет.Партнер.Пустая() тогда
	иначе
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВДГБ_ОбщиеХарактеристикиСрезПоследних.Объект КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ВДГБ_ОбщиеХарактеристики.СрезПоследних(
		|			,
		|			Значение = &Контрагент
		|				И Свойство = &СобственникЛС) КАК ВДГБ_ОбщиеХарактеристикиСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Отчет.Партнер);
	Запрос.УстановитьПараметр("СобственникЛС", ПланыВидовХарактеристик.ВДГБ_ОбщиеХарактеристики.СобственникЛицевогоСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗРез=РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если тзрез.Количество()=1 тогда
		 	отчет.ЛицевойСчет=ВыборкаДетальныеЗаписи.лицевойсчет;
		КонецЕсли;
		НовСтр=отчет.ЛицевыеСчета.Добавить();
		Новстр.лицевойсчет=ВыборкаДетальныеЗаписи.лицевойсчет;
		
	КонецЦикла;
	

	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	
	Если Отчет.ЛицевойСчет.Пустая() тогда
		 отчет.Партнер=Справочники.Партнеры.ПустаяСсылка();
	иначе
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВДГБ_ОбщиеХарактеристикиСрезПоследних.Значение КАК Партнер
		|ИЗ
		|	РегистрСведений.ВДГБ_ОбщиеХарактеристики.СрезПоследних(
		|			,
		|			Объект = &ЛицевойСчет
		|				И Свойство = &СобственникЛС) КАК ВДГБ_ОбщиеХарактеристикиСрезПоследних";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Отчет.ЛицевойСчет);
	Запрос.УстановитьПараметр("СобственникЛС", ПланыВидовХарактеристик.ВДГБ_ОбщиеХарактеристики.СобственникЛицевогоСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		отчет.Партнер=ВыборкаДетальныеЗаписи.партнер;
	КонецЦикла;
	

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если отчет.ИзНачисленияПроцентов=истина тогда
		СформироватьОтчет();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоОбъектуНаСервере()

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВДГБ_ЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВДГБ_ЛицевыеСчета КАК ВДГБ_ЛицевыеСчета
		|ГДЕ
		|	ВДГБ_ЛицевыеСчета.ОбъектУчета = &ОбъектУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВДГБ_ЛицевыеСчета.НомерДома,
		|	ВДГБ_ЛицевыеСчета.Квартира";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр=отчет.ЛицевыеСчета.Добавить();
		НовСтр.ЛицевойСчет=ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ПередаваемыеПараметры)   Экспорт
	Если Результат=КодВозвратаДиалога.Отмена Тогда Возврат;	КонецЕсли;
	Если ПередаваемыеПараметры.вариант=1 Тогда
		Если Результат=КодВозвратаДиалога.Да Тогда 
			отчет.ЛицевыеСчета.Очистить();
		КонецЕсли;
	ЗаполнитьПоОбъектуНаСервере(); 
		
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПоОбъекту(Команда) 
	Если ОбъектУчета.Пустая() тогда
		сообщить("В начале выберите объект");
	иначе     
		
	 ПараметрыВопроса=Новый Структура;
	 ПараметрыВопроса.Вставить("Вариант",1);
	
	Если отчет.ЛицевыеСчета.Количество()>0 Тогда
    	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение,"Очистить табличную часть?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
	ЗаполнитьПоОбъектуНаСервере(); 

	КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервереБезОплат(КлючУникальности)
	
	Результат.Очистить();	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");   
	Схема = ОтчетОбъект.ПолучитьМакет("МакетБезОплат");

	//Если ПустаяСтрока(Муниципальные) или Муниципальные="Все" тогда
	//     Схема = ОтчетОбъект.ПолучитьМакет("Макет");
	//Конецесли;

	//Если Муниципальные="Исключая" или Муниципальные="Включая" тогда
	//     Схема = ОтчетОбъект.ПолучитьМакет("МакетМун");
	//Конецесли;
	
	
    Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
    Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	//Компоновщик.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.настройки);
	Компоновщик.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	//Компоновщик.ЗагрузитьПользовательскиеНастройки(Компоновщик.ПользовательскиеНастройки);
    
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=НачалоДня(Период.ДатаНачала);
	
	ПараметрДата = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ПараметрДата.Использование=Истина;
	ПараметрДата.Значение=КонецДня(Период.ДатаОкончания);
	
	
	Если НЕ Отчет.партнер=Справочники.Партнеры.ПустаяСсылка() Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Партнер");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = отчет.Партнер; 	
	КонецЕсли;
	
	Если Муниципальные="Включая" Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("муниципальные");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = истина; 	
	КонецЕсли;
	
	Если Муниципальные="Исключая" Тогда
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("муниципальные");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ложь; 	
	КонецЕсли;
	
	Если Отчет.Партнер.Пустая() и Отчет.ЛицевыеСчета.Количество()>0 Тогда  
		            
		СписокЛицевых = новый СписокЗначений;
		
		Для Каждого стр из отчет.ЛицевыеСчета цикл
			СписокЛицевых.Добавить(стр.ЛицевойСчет);
		КонецЦикла;
		
		НовыйЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.
							 Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
							 
		ПолеОтбора = Новый ПолеКомпоновкиДанных("ЛицевойСчет");

		НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
		НовыйЭлементОтбора.Использование  = Истина;
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйЭлементОтбора.ПравоеЗначение = СписокЛицевых; 	
	КонецЕсли;
	
	
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(Схема, Компоновщик.Настройки,ДанныеРасшифровкиКомпоновки);
	
//СкомпоноватьРезультат(Результат, ДанныеРасшифровки); 
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет,,ДанныеРасшифровкиКомпоновки);
		
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ДанныеРасшифровки=ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки,КлючУникальности);
КонецПроцедуры


&НаКлиенте
Процедура БезОплат(Команда)
	КлючУникальности = Новый УникальныйИдентификатор; 
	СформироватьОтчетНаСервереБезОплат(КлючУникальности);
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
КонецПроцедуры

